{
  "https://en.wikipedia.org/wiki/National_Institute_of_Technology%2C_Hamirpur": "Jump to content\n\nArticle\n\nTalk\n\nRead\n\nEdit\n\nView history\n\nTools\n\nCoordinates: 31.7070°N 76.5263°E\n\nFrom Wikipedia, the free encyclopedia\n\nhide\n\nThis article has multiple issues. Please help improve it or discuss these issues on the talk page. (Learn how and when to remove these template messages)\n\nThis article relies excessively on references to primary sources. (July 2016)\n\nThis article contains content that is written like an advertisement. (May 2023)\n\nNational Institute of Technology Hamirpur\n\nFormer names\tRegional Engineering College, Hamirpur\n\nMotto\tउद्यमेन हि सिद्धयान्ति कार्याणि न मनोरथैः॥ (Sanskrit)\n\nMotto in English\tNo substitute for hard work\n\nType\tPublic technical university\n\nEstablished\t1986; 38 years ago\n\nAffiliation\tMinistry of Human Resource Development\n\nDirector\tH. M. Suryawanshi[1]\n\nLocation\tHamirpur, Himachal Pradesh, India\n\nCampus\tUrban, 320 acres (130 ha)\n\nAcronym\tNITH\n\nNickname\tNITians\n\nWebsite\twww.nith.ac.in\n\nNational Institute of Technology Hamirpur (NIT Hamirpur or NITH) is a public technical university located in Hamirpur, Himachal Pradesh, India. It was declared to be an Institute of National Importance by the Government of India under the Institutes of Technology Act.\n\nThe institute was established in 1984 as a Regional Engineering College. It was upgraded to NIT[2] in 2003 by the parliament of India. NIT Hamirpur offers a comprehensive curriculum for undergraduate, graduate and doctorate studies in various fields of architecture, engineering, pure sciences and humanities.[3]\n\nHistory[edit]\n\nMain article: History of RECs\n\nFoundation[edit]\n\nThe institute came into existence on 7 August 1986 as Regional Engineering College, Hamirpur in Hamirpur, Himachal Pradesh, India. It was a joint enterprise of the Government of India and the Government of Himachal Pradesh. The classes commenced at Government Polytechnic College, Hamirpur as REC Hamirpur did not initially have a campus. The classes and administration moved to their current location in 1987. At its inception, the institute only had three departments, Civil Engineering, Electrical and Electronics Engineering and Mechanical Engineering. Later, two more departments, Electronics and Communication Engineering (1988) and Computer Science and Engineering (1989) were added. The department of Architecture was established in 2000. Recently in 2013, the Chemical Engineering department came into existence. The institute offered undergraduate courses until 2005. Thereafter, graduate and Ph.D programs became available.\n\nOn 26 June 2002, REC Hamirpur was awarded the status of deemed university and upgraded into a National Institute of Technology. As a result of this transition the institute came under the sole purview of the Government of India. It was awarded the status of Institute of National Importance by an Act of Parliament along with other NITs and IITs. NIT Hamirpur has been ranked as best NIT in terms of infrastructure by the World Bank in 2007.[4]\n\nCampus[edit]\n\nThe institute campus is situated in the Hamirpur district of Himachal Pradesh, India, at an altitude of 900 meters above sea level. The campus is spread across 320 acres and is located on a hilly terrain which is surrounded by pine trees.[citation needed] The distance to campus from main bus terminus of Hamirpur city is approximately 4 kilometers. The nearest situated airport is Kangra Airport at 86.9 kilometers. Bus and cab facilities are easily available for the campus.\n\nBeing a residential campus, there are eight boys' hostels and four girls' hostels, with residences for the faculty and staff. Some hostels have four-seated or triple-seated rooms, while others have doublets and singlets. Mega Hostel is the newest and largest in its capacity.[5]\n\nHostels[edit]\n\nBoys' Hostels\n\nKailash Boys' Hostel\n\nShivalik Boys' Hostel\n\nDhauladhar Boys' Hostel\n\nVindhyachal Boys' Hostel\n\nNeelkanth Boys' Hostel\n\nHimadri Hostel\n\nHimgiri Hostel\n\nUdaygiri Hostel\n\nGirls' Hostels\n\nParvati Girls' Hostel\n\nAmbika Girls' Hostel\n\nAravali Hostel\n\nManimahesh Girls' Hostel\n\nSatpura Hostel\n\nComputer Centre[edit]\n\nComputer Centre is a central facility, which caters to the needs of academic departments. The aim of the centre is to provide professional services, promote and assist the use of new computing technology among the students, staff and administration.[6] The website of NITH, is also maintained by the computer center.\n\nCentral Library[edit]\n\nThe institute library was set up in 1986 in one room of Government Polytechnic Hamirpur and was shifted to the institute campus in 1988 in Visvesvarya Block. At present it is in a separate building with the floor area of 3200 square meters. The library has more than 100,000 books and numerous scientific journals in both print and electronic format. The reading halls of the library can accommodate around 600 people at a time. Building is facilitated with water coolers, heaters Wi-Fi etc.[7] The library uses OPAC to issue books.\n\nSports[edit]\n\nNIT Hamirpur provides sports facilities for indoor and outdoor games. Teams are sent out to compete in university-level sports competition. Sports facilities include Karate, cricket, football, lawn tennis, basketball, volleyball, table tennis, badminton and athletics.[8] Annual sports events such as Lalkar is also celebrated with several events such as relay, shot put, 100m race etc. Inter branch and inter year sports matches such as football and cricket are also held round the year.\n\nHealth Centre[edit]\n\nNIT Hacentre. It is equipped with basic medical facilities and in case of emergency, patients are referred to the Zonal Hospital, Hamirpur.[9]\n\nOrganization and administration[edit]\n\nDepartments[edit]\n\nNIT Hamirpur has 13 departments and a center of excellence. The academic departments at NIT Hamirpur include the following\n\nComputer Science and Engineering\n\nCivil Engineering\n\nChemical Engineering\n\nElectronics and Communication Engineering\n\nElectrical Engineering\n\nMechanical Engineering\n\nMaterial Sciences & Engineering\n\nChemistry\n\nMathematics & Scientific Computing\n\nPhysics & Photonic Science\n\nArchitecture\n\nHumanities & Social Sciences\n\nManagement Studies\n\nCenter[edit]\n\nThe a center of excellence located at NIT Hamirpur is\n\nCentre for Energy Studies\n\nAcademics[edit]\n\nRanking[edit]\n\nCollege rankings\n\nEngineering – India\n\nNIRF (2022)[10]\t128\n\nArchitecture – India\n\nNIRF (2022)[11]\t26\n\nNIRF (2023)[12]\t28\n\nNational Institute of Technology, Hamirpur was ranked 128 among engineering colleges by the National Institutional Ranking Framework (NIRF) in 2022.[10]\n\nDepartment of Architecture, NIT, Hamirpur was ranked 26 among all Architecture colleges by the National Institutional Ranking Framework (NIRF) in 2022.[11]\n\nDepartment of Architecture, NIT, Hamirpur was ranked 28 among all Architecture colleges by the National Institutional Ranking Framework (NIRF) in 2023.[12]\n\nStudent life[edit]\n\nHill'ffair[edit]\n\nStudents performing at Open Air Theater during Hill'ffair 2005\n\nHill'ffair is a cultural event of the institute, organized at the national level, with the involvement of bands, singers, musicians, artist, poets and participants from all across the country. Two days and three nights of performance with over a wide genre of dance, music, drama.[13] Cultural activities and various student clubs are a few options that act as a catalyst in developing technical, managerial, conceptual skills amongst students. NIT Hamirpur provides a number of such platforms in the forms of clubs to its students to select a club as per his/her likes and channelize their energies in translating their ideas into reality. The event is a three day long event which consists of a star night, where several artists such as\n\nNIMBUS[edit]\n\nNIMBUS is the annual technical festival of National Institute of Technology, Hamirpur, Himachal Pradesh, India. It is touted to be an amalgamation of ideas, expressions, innovations, prototypes, knowledge channels, taken to the most premier levels. In NIMBUS all the departmental teams compete with their best projects, demonstrations and Events. Students from Himachal and outside Himachal Pradesh come to participate in\n\nthese events. There are two types of teams, core and departmental teams. The departmental teams are:\n\nABRAXAS (Eng. Physics)- Best departmental team of NIMBUS-2k24\n\nOJAS (Electrical Eng.)\n\nMEDEXTROUS (Mechanical Eng.)\n\nVIBHAV (Electronics & Comm)\n\nC HELIX (Civil Eng.)\n\nHermetica (Chemical Eng.)\n\nTeam .EXE (Computer Science and Engineering)\n\nDesign O Crats (Architecture)\n\nMetamorph (Material science Eng.)\n\nMatcom(MNC Department)\n\nand the core teams are:\n\nTeam Finance and Treasury\n\nResurgence\n\nPixonoids\n\nPublic Relations\n\nMusic Club\n\nRhythmeecz\n\nDiscipline Club\n\nOrganization Club\n\nFine Art Club\n\nTeam Technical\n\nLalkaar\n\nNational Institute of Technology Hamirpur is one of the premier technical institutes in Northern India. The Institute presently provides sports facilities for both outdoor and indoor activity. A standard size stadium with provision of pavilion has been provided to the student where the games like Cricket, Football, Basketball, Volleyball, Lawn Tennis martial art karate for self defense and Athletics are played. Student's Activity Center(SAC) is recently build with world class facilities to host various extra-curricular activities by the students.\n\nNotable alumni[edit]\n\nProf. Dr.-Ing. Habil. Mohit Kumar, Professor for \"Computational Intelligence in Automation (apl)\" at the University of Rostock, Germany,[14] Key Researcher Data Science and Research Team Lead AI Regulations and Security at Software Competence Center Hagenberg, Austria.[15]\n\nVijay Kumar Thakur, scientist in Manufacturing Enhanced Composites & Structures Centre.[16] at Cranfield University.\n\nMr. Nitesh Gupta, Director Engineering at Intel Corporation.\n\nKumar Vijay Mishra, ARL Senior Fellow, US Army Research Laboratory.\n\nMr. Samneet Thakur, Data Scientist, ISRO\n\nSee also[edit]\n\nDr. B. R. Ambedkar National Institute of Technology Jalandhar\n\nNational Institute of Technology, Kurukshetra\n\nNational Institute of Technology, Jamshedpur\n\nNational Institute of Technology, Warangal\n\nReferences[edit]\n\n^ \"Director NITH\". Nith.ac.in. Retrieved 23 August 2020.\n\n^ \"Kalvimalar - News\". Dinamalar. Archived from the original on 29 August 2016. Retrieved 9 January 2024.\n\n^ \"About NITH\". Nith.ac.in. Retrieved 16 February 2016.\n\n^ \"NITH Newsletter, Aug 2008\" (PDF). Retrieved 7 December 2011.\n\n^ \"Hostels NITH\". Nith.ac.in. Retrieved 17 February 2016.\n\n^ \"Computer Centre NITH\". Nith.ac.in. Retrieved 17 February 2016.\n\n^ \"Central Library NITH\". Nith.ac.in. Retrieved 16 February 2016.\n\n^ \"Sports Complex NITH\". nith.ac.in. Retrieved 16 February 2016.\n\n^ \"Health Centre NITH\". nith.ac.in. Retrieved 16 February 2016.\n\n^\n\nJump up to:\n\na b \"National Institutional Ranking Framework 2022 (Engineering)\". National Institutional Ranking Framework. Ministry of Education. 15 July 2022.\n\n^\n\nJump up to:\n\na b \"National Institutional Ranking Framework 2022 (Architecture)\". National Institutional Ranking Framework. Ministry of Education. 15 July 2022.\n\n^\n\nJump up to:\n\na b \"National Institutional Ranking Framework 2023 (Architecture)\". National Institutional Ranking Framework. Ministry of Education. 5 June 2023.\n\n^ \"Hill'ffair\". nith.ac.in. Retrieved 16 February 2016.\n\n^ \"Prof. Mohit Kumar\". Retrieved 13 December 2021.\n\n^ \"Prof. Mohit Kumar\". Retrieved 13 December 2021.\n\n^ \"Dr Vijay Kumar Thakur\". www.cranfield.ac.uk. Retrieved 1 November 2018.\n\nExternal links[edit]\n\nWikimedia Commons has media related to National Institute of Technology, Hamirpur.\n\nOfficial website\n\nshow\n\nNational Institutes of Technology (NITs)\n\nshow\n\nUniversities in Himachal Pradesh\n\nshow\n\nState of Himachal Pradesh\n\nAuthority control databases\n\nISNIVIAF\n\nCategories: National Institutes of TechnologyEngineering colleges in Himachal PradeshHamirpur, Himachal PradeshEducational institutions established in 19861986 establishments in Himachal PradeshEducation in Hamirpur district, Himachal PradeshAll India Council for Technical Education"
}